//identifier คือ ชื่อที่แดป ตั้งขึ้นมาเอง (ตัวแปร, ฟังต์ชั่น, ค่าคงที่, คลาส, ออปเจ็กต์ )ต้องเป็นไปตามกฎที่ตั้งชื่อ
//- ไม่เว้นวรรค ไม่ขึ้นต้นด้วยตัวเลข ไม่ใฃ่คำสงวน/ค่าสัญ(reserved word/keyword)
//-ไม่ใช้สัญลักษณ์พิเศษ ยกเว้น _,$
//-ควรตั้งเป็น Pascal Case, Camel

// Code block คือ ขอบเขตการทำงาน

//variable ตัวแปร คือ ชื่อที่เดปตั้งขึ้นมาเองเอาไว้เก็บข้อมูลที่เกิดขึ้นในโปรแกรม
var dtiVar01 = `aaa` //แก้ไขได้ แต่เป็น global ใฃ้ที่ไหนก็ได้
let dtiVar02 = `bbb` //แก้ไขได้ เป็น local ***
const dti03 = `ccc` //แก้ไขไม่ได้ เป็น local ***

dti01 = `111`
dti02 = `222`
{
    var dti04 = `ddd`
    let dti05 = `eee`
    console.log(dtiVar01, dtiVar02, dti03, dti04, dti05)
}